{"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["dense_8", 0, 0]], "name": "model_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "sparse": false, "dtype": "float32", "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "RandomNormal", "config": {"stddev": 0.02, "mean": 0.0, "seed": null}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_5", "units": 1024, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "dense_5", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_4", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_1", "trainable": true, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_6", "units": 512, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "dense_6", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_5", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_7", "units": 256, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "dense_7", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.20000000298023224}, "name": "leaky_re_lu_6", "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.3, "noise_shape": null, "name": "dropout_3", "trainable": true, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_8", "units": 1, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}, "name": "dense_8", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}]}, "keras_version": "2.1.2", "backend": "tensorflow"}